---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.NumberOfSteps
source: html/b62b2692-916e-6c5c-fb02-b2bcd957314f.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.NumberOfSteps Property

Number of steps (values between minimum and maximum) to be shown in legend.

## Syntax (C#)
```csharp
public int NumberOfSteps { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentsInconsistentException** - When setting this property: numberOfSteps is greater than 1000 or less than 0